---
type: IPipePlumbingFixtureFlowServer
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 3
tags: [revit-api, class]
---

# IPipePlumbingFixtureFlowServer

`Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Calculate | 2014 | `void Calculate ( PipePlumbingFixtureFlowData data )` |
| Method | GetHtmlDescription | 2014 | `string GetHtmlDescription ()` |
| Method | GetInformationLink | 2014 | `string GetInformationLink ()` |